### Q1. Show how the data in the table below can be put into third normal form.

#### Only need to give the final output. No need to output some immediate tables that satisfy 1NF or 2NF.

#### One teacher can teach mutiple courses.  But each course has only one teacher. 

| Student Number | Student Name | DoB        | Gender | Course Number            | Course Name                        | TeacherID            | Teacher Name                  |
|----------------|--------------|------------|--------|--------------------------|------------------------------------|----------------------|-------------------------------|
| 2333           | Bell, K      | 14/01/1998 | M      | COMP23                   | Java1                              | 8563                 | Davey, A                      |
| 23333           | Cope, F      | 12/08/1997 | F      | COMP23<br>COMP16<br>G101 | Java1<br>Intro to OOP<br>Animation | 8563<br>2299<br>1567 | Davey, A<br>Ross, M<br>Day, S |
| 233333           | Behr, K      | 31/07/1996 | M      | COMP16<br>COMP34         | Intro to OOP<br>Database Design    | 2299<br>3370         | Ross, M<br>Blaine, N          |

In [4]:
#### your code here

| Teacher ID | Teacher Name |
|------------|--------------|
| 8563       | Davey, A     |
| 2299       | Ross, M      |
| 1567       | Day, S       |
| 3370       | Blaine, N    |

| Course Number | Course Name     |
|---------------|-----------------|
| COMP23        | Java1           |
| COMP16        | Intro to OOP    |
| G101          | Animation       |
| COMP34        | Database Design |

|Student Number|Student Name|Date of Birth| Gender|
|--------------|------------|-------------|-------|
|2333|Bell, K 14/01/1998|14/1/1998|M|
|23333|Cope, F 12/08/1997|12/8/1997|F|
|233333|Behr, K 31/07/1996|31/7/1996|M|

| Teacher ID | Course Number |
|------------|---------------|
| 8563       | COMP23        |
| 2299       | COMP16        |
| 1567       | G101          |
| 3370       | COMP34        |

| Student Number | Course Number |
|----------------|---------------|
| 2333           | COMP23        |
| 23333          | COMP23        |
| 233333         | COMP16        |
| 233333         | COMP34        |

### Q2. Construct an SQLite database with the following two tables (optional: do an inner join).

#### When creating these tables, no need to specify the primary key or foreign key

|ProductID|ProductName|Cost|Price|
|---------|-----------|----|-----|
|123|Small monkey|2.50|5.95|
|156|Pink Kitten|3.10|6.00|

| ProductID|CompID|CompQty|
|----------|------|-------|
|123|ST01|30|
|123|G56|2|
|123|FF77|0.3|
|156|ST01|45|
|156|G120|2|
|156|FF88|0.35|
|156|S34|1|

In [1]:
import sqlite3 as sq3

sq3_file = "db.product"
db = sq3.connect(sq3_file)

with db:
    db.execute("CREATE TABLE IF NOT EXISTS product(id INT, name TEXT, cost REAL, price REAL)")
    data = [
        (123, "Small monkey", 2.50, 5.95),
        (156, "Pink Kitten", 3.10, 6.00 ),        
    ]
    for d in data:
        db.execute("INSERT INTO product VALUES (?, ?, ?, ?)", d)

with db:
    db.execute("CREATE TABLE IF NOT EXISTS comp (id INT, compid TEXT, compqty REAL)")
    data = [
        (123, "ST01", 30),
        (123, "G56", 2),
        (123, "FF77", 0.3),
        (156, "ST01", 45),
        (156, "G120", 2),
        (156, "FF88", 0.35),
        (156, "S34", 1)
    ]
    for d in data:
        db.execute("INSERT INTO comp VALUES (?, ?, ?)", d)

db.commit()
db.close()